Revit 2024 API
BuiltInFailures.DesignOptionFailures.ConfusingPadByElementsInMainModelWarn Property
 A pad in a design option cannot be hosted by topography in the Main Model [--if you continue it will not be added to the design option set].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ConfusingPadByElementsInMainModelWarn { get; }
Visual Basic
Public Shared ReadOnly Property ConfusingPadByElementsInMainModelWarn As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ConfusingPadByElementsInMainModelWarn {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace